In [23]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [24]:
df = pd.read_csv("V:\\Datasets\\Data preprocessing.csv")

In [25]:
df.head()

   Sno  Country   Age   Salary  Purchased
0    0   France  44.0  72000.0          0
1    1   Spain   27.0  48000.0          1
2    2  Germany  30.0  54000.0          0
3    3   Spain   38.0  61000.0          0
4    4  Germany  40.0      NaN          1

In [30]:
df = df.drop(['Sno'],axis =1 )

In [31]:
df.head()

   Country   Age   Salary  Purchased
0   France  44.0  72000.0          0
1   Spain   27.0  48000.0          1
2  Germany  30.0  54000.0          0
3   Spain   38.0  61000.0          0
4  Germany  40.0      NaN          1

### Extracting the Independent Variable

In [37]:
x = df.iloc[:,:-1].values
x

array([['France', 44.0, 72000.0],
       ['Spain ', 27.0, 48000.0],
       ['Germany', 30.0, 54000.0],
       ['Spain ', 38.0, 61000.0],
       ['Germany', 40.0, nan],
       ['France', 35.0, 58000.0],
       ['Spain ', nan, 52000.0],
       ['France', 48.0, 79000.0],
       ['Germany', 50.0, 83000.0],
       ['France', 37.0, 67000.0]], dtype=object)

### Extraction Dependent Variable

In [38]:
y = df.iloc[:,-1].values
y

array([0, 1, 0, 0, 1, 1, 0, 1, 0, 1], dtype=int64)

### Filling the dataset with mean attribute Value

In [41]:
df['Age'] = df['Age'].fillna(0)

In [42]:
df['Age']

0    44.0
1    27.0
2    30.0
3    38.0
4    40.0
5    35.0
6     0.0
7    48.0
8    50.0
9    37.0
Name: Age, dtype: float64